app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def csvi
    @users = User.all.sort

SELECT "users".* FROM "users"
---
  def results
    @users = User.all.sort

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "108"]]
UPDATE "users" SET "age" = 'Under 18', "employment" = 'Making less than $1500 per month', "medical" = 'Yes', "attorney" = 'No', "previous" = 'No', "desc" = 'testtesttest', "updated_at" = '2013-09-24 22:32:32.189169' WHERE "users"."id" = 41
---
  def update
    @user = User.find(params[:id])
    if params["age"]
      @user.age = params["age"]
      @user.save!